freebsd/pkg/docs/pkg-backup.8
.\"
.\" FreeBSD pkg - a next generation package for the installation and maintenance
.\" of non-core utilities.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\"
.\"     @(#)pkg.8
.\"
.Dd August 18, 2014
.Dt PKG-BACKUP 8
.Os
.Sh NAME
.Nm "pkg backup"
.Nd backup and restore the local package database
.Sh SYNOPSIS
.Nm
.Op Fl q
.Fl d Ar dest_file
.Nm
.Op Fl q
.Fl r Ar src_file
.Pp
.Nm
.Op Cm --quiet
.Cm --dump Ar dest_file
.Nm
.Op Cm --quiet
.Cm --restore Ar src_file
.Sh DESCRIPTION
is used for backing up and restoring of the local package database.
.Sh OPTIONS
The following options are supported by
.Nm :
.Bl -tag -width restore
.It Fl d Ar dest_file , Cm --dump Ar dest_file
Dumps the local package database to a file specified on the command-line.
.It Fl q , Cm --quiet
Force quiet output.
.It Fl r Ar src_file , Cm --restore Ar src_file
Uses
.Ar src_file
in order to restore the local package database.
Useful in case of a database
crash or loss to restore your database from a previously made backup.
.El
.Sh ENVIRONMENT
The following environment variables affect the execution of
.Nm .
See
.Xr pkg.conf 5
for further description.
.Bl -tag -width ".Ev NO_DESCRIPTIONS"
.It Ev PKG_DBDIR
.El
.Sh FILES
See
.Xr pkg.conf 5 .
.Sh SEE ALSO
.Xr pkg_printf 3 ,
.Xr pkg_repos 3 ,
.Xr pkg-repository 5 ,
.Xr pkg.conf 5 ,
.Xr pkg 8 ,
.Xr pkg-add 8 ,
.Xr pkg-annotate 8 ,
.Xr pkg-audit 8 ,
.Xr pkg-autoremove 8 ,
.Xr pkg-check 8 ,
.Xr pkg-clean 8 ,
.Xr pkg-config 8 ,
.Xr pkg-convert 8 ,
.Xr pkg-create 8 ,
.Xr pkg-delete 8 ,
.Xr pkg-fetch 8 ,
.Xr pkg-info 8 ,
.Xr pkg-install 8 ,
.Xr pkg-lock 8 ,
.Xr pkg-query 8 ,
.Xr pkg-register 8 ,
.Xr pkg-repo 8 ,
.Xr pkg-rquery 8 ,
.Xr pkg-search 8 ,
.Xr pkg-set 8 ,
.Xr pkg-shell 8 ,
.Xr pkg-shlib 8 ,
.Xr pkg-ssh 8 ,
.Xr pkg-stats 8 ,
.Xr pkg-update 8 ,
.Xr pkg-updating 8 ,
.Xr pkg-upgrade 8 ,
.Xr pkg-version 8 ,
.Xr pkg-which 8
