freebsd/pkg/docs/pkg-convert.8
.\"
.\" FreeBSD pkg - a next generation package for the installation and maintenance
.\" of non-core utilities.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\"
.\"     @(#)pkg.8
.\" $FreeBSD$
.\"
.Dd November 02, 2014
.Dt PKG-CONVERT 8
.Os
.Sh NAME
.Nm "pkg convert"
.Nd convert from/to pkgng database format
.Sh SYNOPSIS
.Nm
.Op Fl d Ar pkg_dbdir
.Op Fl n
.Pp
.Nm
.Op Cm --pkg-dbdir Ar pkg_dbdir
.Op Cm --dry-run
.Sh DESCRIPTION
.Nm
is used to convert from/to
.Xr pkg 8
local database to legacy pkg_install tools format.
.Sh OPTIONS
The following options are supported by
.Nm :
.Bl -tag -width revert
.It Fl d Ar pkg_dbdir , Cm --pkg-dbdir Ar pkg_dbdir
The location of the
.Xr pkg_add 1
dbdir.
Defaults to
.Fa /var/db/pkg .
.It Fl n , Cm --dry-run
Dry-run mode.
Do not actually convert anything.
Just show what would be done.
.El
.Sh FILES
See
.Xr pkg.conf 5 .
.Sh SEE ALSO
.Xr pkg_printf 3 ,
.Xr pkg_repos 3 ,
.Xr pkg-repository 5 ,
.Xr pkg.conf 5 ,
.Xr pkg 8 ,
.Xr pkg-add 8 ,
.Xr pkg-annotate 8 ,
.Xr pkg-audit 8 ,
.Xr pkg-autoremove 8 ,
.Xr pkg-backup 8 ,
.Xr pkg-check 8 ,
.Xr pkg-clean 8 ,
.Xr pkg-config 8 ,
.Xr pkg-create 8 ,
.Xr pkg-delete 8 ,
.Xr pkg-fetch 8 ,
.Xr pkg-info 8 ,
.Xr pkg-install 8 ,
.Xr pkg-lock 8 ,
.Xr pkg-query 8 ,
.Xr pkg-register 8 ,
.Xr pkg-repo 8 ,
.Xr pkg-rquery 8 ,
.Xr pkg-search 8 ,
.Xr pkg-set 8 ,
.Xr pkg-shell 8 ,
.Xr pkg-shlib 8 ,
.Xr pkg-ssh 8 ,
.Xr pkg-stats 8 ,
.Xr pkg-update 8 ,
.Xr pkg-updating 8 ,
.Xr pkg-upgrade 8 ,
.Xr pkg-version 8 ,
.Xr pkg-which 8
