freebsd/pkg/docs/pkg-alias.8
.\"
.\" FreeBSD pkg - a next generation package for the installation and maintenance
.\" of non-core utilities.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\"
.\"     @(#)pkg.8
.\"
.Dd May 13, 2018
.Dt PKG-ALIAS 8
.Os
.Sh NAME
.Nm "pkg alias"
.Nd display configured aliases
.Sh SYNOPSIS
.Nm
.Op Fl q
.Op Fl l
.Pp
.Nm "pkg alias"
.Op Fl -quiet
.Op Fl -list
.Ar [alias]
.Sh DESCRIPTION
.Nm
displays configured aliases
If given the name of an existing alias only shows the aliased arguments to
.Xr pkg 8 .
Without arguments all aliases and their respective
.Xr pkg 8
arguments are printed.
.Sh OPTIONS
The following options are supported by
.Nm :
.Bl -tag -width quiet
.It Fl l , Fl -list
Print all aliases, one alias per line, without their
.Xr pkg 8
arguments.
.It Fl q , Fl -quiet
Force quiet output (suppress column headers).
.El
.Sh FILES
.Xr pkg.conf 5
.Sh EXAMPLES
Display all aliases:
.Dl % pkg alias
.Pp
Display
.Xr pkg 8
for alias
.Dq Li size :
.Dl % pkg alias size
.Sh SEE ALSO
.Xr pkg_printf 3 ,
.Xr pkg_repos 3 ,
.Xr pkg-repository 5 ,
.Xr pkg.conf 5 ,
.Xr pkg 8 ,
.Xr pkg-add 8 ,
.Xr pkg-annotate 8 ,
.Xr pkg-audit 8 ,
.Xr pkg-autoremove 8 ,
.Xr pkg-backup 8 ,
.Xr pkg-check 8 ,
.Xr pkg-clean 8 ,
.Xr pkg-config 8 ,
.Xr pkg-create 8 ,
.Xr pkg-delete 8 ,
.Xr pkg-fetch 8 ,
.Xr pkg-info 8 ,
.Xr pkg-install 8 ,
.Xr pkg-lock 8 ,
.Xr pkg-query 8 ,
.Xr pkg-register 8 ,
.Xr pkg-repo 8 ,
.Xr pkg-rquery 8 ,
.Xr pkg-search 8 ,
.Xr pkg-set 8 ,
.Xr pkg-shell 8 ,
.Xr pkg-shlib 8 ,
.Xr pkg-ssh 8 ,
.Xr pkg-stats 8 ,
.Xr pkg-update 8 ,
.Xr pkg-updating 8 ,
.Xr pkg-upgrade 8 ,
.Xr pkg-version 8 ,
.Xr pkg-which 8
