freebsd/pkg/pkg/pkg-lock.8
.\"
.\" FreeBSD pkg - a next generation package for the installation and maintenance
.\" of non-core utilities.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\"
.\"     @(#)pkg.8
.\" $FreeBSD$
.\"
.Dd May 12, 2012
.Dt PKG-LOCK 8
.Os
.Sh NAME
.Nm "pkg lock" ,
.Nm "pkg unlock"
.Nd lock or unlock packages
.Sh SYNOPSIS
.Nm
.Op Fl yq
.Fl a
.Nm
.Op Fl gxXyq
.Ar <pkg-name>
.Nm "pkg unlock"
.Op Fl yq
.Fl a
.Nm "pkg unlock"
.Op Fl gxXyq
.Ar <pkg-name>
.Sh DESCRIPTION
.Nm
is used to lock packages against reinstallation,
modification or deletion.
.Nm "pkg unlock"
unlocks the named packages.
Either variant only has an effect on currently installed packages.
Consequently it is impossible to block installation of a new package
by using this mechanism, unless such an installation implies updating
a locked package.
.Pp
The impact of locking a package is wider than simply preventing
modifications to the package itself.
.Cm Any
operation implying modification of the locked package will be
blocked.
This includes:
.Pp
.Bl -bullet -compact
.It
Attempts to reinstall, up- or downgrade or delete the locked package
itself.
.It
Installation, up- or downgrade of a package where the resultant
package would have a dependency on a different version of the locked
package.
.It
Deletion, up- or downgrade of any package the locked package depends
upon, either directly or as a consequence of installing or upgrading
some third package.
.El
.Sh OPTIONS
The following options are supported by
.Nm :
.Bl -tag -width F1
.It Fl a
Lock or unlock all installed packages.
.It Fl q
Operate quietly: do not output anything other than confirmatory questions.
.It Fl y
Assume "yes" as the answer to all questions.
.It Fl g
Treat
.Ar <pkg-name>
as a shell glob pattern.
.It Fl x
Treat
.Ar <pkg-name>
as a regular expression.
.It Fl X
Treat
.Ar <pkg-name>
as an extended regular expression.
.El
.Sh ENVIRONMENT
The following environment variables affect the execution of
.Nm .
See
.Xr pkg.conf 5
for further description.
.Bl -tag -width ".Ev NO_DESCRIPTIONS"
.It PKG_DBDIR
.El
.Sh FILES
See
.Xr pkg.conf 5 .
.Sh SEE ALSO
.Xr pkg 8 ,
.Xr pkg-add 8 ,
.Xr pkg-audit 8 ,
.Xr pkg-autoremove 8 ,
.Xr pkg-backup 8 ,
.Xr pkg-check 8 ,
.Xr pkg-clean 8 ,
.Xr pkg-create 8 ,
.Xr pkg-delete 8 ,
.Xr pkg-fetch 8 ,
.Xr pkg-info 8,
.Xr pkg-install 8 ,
.Xr pkg-query 8 ,
.Xr pkg-register 8 ,
.Xr pkg-repo 8 ,
.Xr pkg-rquery 8 ,
.Xr pkg-search 8 ,
.Xr pkg-set 8 ,
.Xr pkg-shell 8 ,
.Xr pkg-shlib 8 ,
.Xr pkg-stats 8 ,
.Xr pkg-update 8 ,
.Xr pkg-updating 8 ,
.Xr pkg-upgrade 8 ,
.Xr pkg-version 8 ,
.Xr pkg-which 8 ,
.Xr pkg.conf 5
