freebsd/pkg/pkg/pkg-update.8
.\"
.\" FreeBSD pkg - a next generation package for the installation and maintenance
.\" of non-core utilities.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\"
.\"     @(#)pkg.8
.\" $FreeBSD$
.\"
.Dd May 2, 2012
.Dt PKG-UPDATE 8
.Os
.Sh NAME
.Nm "pkg update"
.Nd updates remote package repository databases
.Sh SYNOPSIS
.Nm
.Op Fl q
.Sh DESCRIPTION
.Nm
is used for updating from remote package repository databases.
.Pp
The remote repository databases to be updated are defined in the
.Xr pkg.conf 5
file.
.Pp
It is always a good idea to update your remote package
repositories before doing a remote install via
.Xr pkg-install 8
or upgrades via
.Xr pkg-upgrade 8 .
.Pp
.Ss Signed repositories
If the repository is signed and
.Ev PUBKEY
is defined, it will be verified after being downloaded.
If
.Ev SIGNED_REPOS
is enabled, the repository will be required to be signed to be valid or it will be discarded.
See
.Xr pkg.conf 5
for more information on these variables.
.Sh OPTIONS
The following options are supported by
.Nm :
.Bl -tag -width F1
.It Fl q
Force quiet output
.El
.Sh ENVIRONMENT
The following environment variables affect the execution of
.Nm .
See
.Xr pkg.conf 5
for further description.
.Bl -tag -width ".Ev NO_DESCRIPTIONS"
.It Ev PACKAGESITE
.It Ev PKG_DBDIR
.It Ev PKG_MULTIREPOS
.It Ev SIGNED_REPOS
.It Ev PUBKEY
.El
.Sh FILES
See
.Xr pkg.conf 5 .
.Sh SEE ALSO
.Xr pkg 8 ,
.Xr pkg-add 8 ,
.Xr pkg-audit 8 ,
.Xr pkg-autoremove 8 ,
.Xr pkg-backup 8 ,
.Xr pkg-check 8 ,
.Xr pkg-clean 8 ,
.Xr pkg-create 8 ,
.Xr pkg-delete 8 ,
.Xr pkg-fetch 8 ,
.Xr pkg-info 8 ,
.Xr pkg-install 8 ,
.Xr pkg-query 8 ,
.Xr pkg-register 8 ,
.Xr pkg-repo 8 ,
.Xr pkg-rquery 8 ,
.Xr pkg-search 8 ,
.Xr pkg-set 8 ,
.Xr pkg-shell 8 ,
.Xr pkg-shlib 8 ,
.Xr pkg-updating 8 ,
.Xr pkg-upgrade 8 ,
.Xr pkg-version 8 ,
.Xr pkg-which 8 ,
.Xr pkg.conf 5
