freebsd/pkg/pkg/pkg-query.8
.\"
.\" FreeBSD pkg - a next generation package for the installation and maintenance
.\" of non-core utilities.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\"
.\"     @(#)pkg.8
.\" $FreeBSD$
.\"
.Dd July 18, 2012
.Dt PKG-QUERY 8
.Os
.Sh NAME
.Nm "pkg query"
.Nd query information for installed packages
.Sh SYNOPSIS
.Nm
.Ao query-format Ac Ao pkg-name Ac
.Nm
.Op Fl a
.Ao query-format Ac
.Nm
.Fl F Ao pkg-name Ac Ao query-format Ac
.Nm
.Fl e Ao evaluation-condition Ac Ao query-format Ac
.Nm
.Op Fl gxX
.Ao query-format Ac Ao pattern Ac Ao ... Ac
.Sh DESCRIPTION
.Nm
is used for displaying information about packages.
.Sh OPTIONS
The following options are supported by
.Nm :
.Bl -tag -width F1
.It Fl a
Match all packages from the database
.It Fl e
Match packages using the given
.Ar evaluation-condition.
See EVALUATION FORMAT for details.
.It Fl F Ar pkg-name
Display information only for the package file
.Ar pkg-name
.It Fl g
Treat
.Ao pattern Ac
as a glob pattern.
.It Fl x
Treat
.Ao pattern Ac
as a regular expression.
.It Fl X
Treat
.Ao pattern Ac
as an extended regular expression.
.El
.Sh QUERY FORMAT
There are two type of keyword for the query format: the multiline and the normal
one. Only one type of multiline pattern is accepted for a given query.
.Ss Normal patterns:
.Bl -tag -width F1
.It Cm \&%n
Name of the matched package
.It Cm \&%v
Version of the matched package
.It Cm \&%o
Origin of the matched package
.It Cm \&%p
Prefix of the matched package
.It Cm \&%m
Maintainer of the matched package
.It Cm \&%c
Comment of the matched package
.It Cm \&%i
Additionnal information about the package
.It Cm \&%w
Home page of the matched package
.It Cm \&%l
license logic of the matched package - nothing for single, & for AND, and | for OR
.It Cm \&%s Ns Op bh
The flat size of the matched package, where
.Cm b
is in bytes, and
.Cm h
is in human readable format.
.It Cm \&%a
Returns 1 if the matched package is an orphan package and can be pkg-autoremove(1)'d, 0 otherwise
.It Cm \&%k
Returns 1 if the matched package is locked against modification or deletion, 0 otherwise
.It Cm \&%M
message contain in the matched package
.It Cm \&%t
Timestamp that the package was installed
.It Cm \&%? Ns Op drCFODLUGB
Returns 0 if the list is empty and 1 if the list has information to display
.Bl -tag -width indent
.It Cm d
for dependencies
.It Cm r
for reverse dependencies
.It Cm C
for categories
.It Cm F
for files
.It Cm O
for options
.It Cm D
for directories
.It Cm L
for licenses
.It Cm U
for users
.It Cm G
for groups
.It Cm B
for shared libraries
.El
.It Cm \&%# Ns Op drCFODLUGB
Returns the number of element in the list
.Bl -tag -width indent
.It Cm d
for dependencies
.It Cm r
for reverse dependencies
.It Cm C
for categories
.It Cm F
for files
.It Cm O
for options
.It Cm D
for directories
.It Cm L
for licenses
.It Cm U
for users
.It Cm G
for groups
.It Cm B
for shared libraries
.El
.El
.Ss Multiline patterns:
.Bl -tag -width F1
.It Cm \&%d Ns Op nov
Expands to the list of dependencies for the matched package, where
.Cm n
stands for the package name,
.Cm o
for the package origin, and
.Cm v
for the package version.
.It Cm \&%r Ns Op nov
Expands to the list of reverse dependencies for the matched package, where
.Cm n
stands for the package name,
.Cm o
for the package origin, and
.Cm v
for the package version.
.It Cm \&%C
Expands to the list of categories the matched package belongs to.
.It Cm \&%F Ns Op ps
Expands to the list of files of the matched package, where
.Cm p
stands for path, and
.Cm s
for sum.
.It Cm \&%D
Expands to the list of directories of the matched package.
.It Cm \&%O Ns Op kv
Expands to the list of options of the matched package, where
.Cm k
stands for option key, and
.Cm v
for option value.
.It Cm \&%L
Expands to the list of license(s) for the matched package.
.It Cm \&%U
Expands to the list of users needed by the matched package.
.It Cm \&%G
Expands to the list of groups needed by the matched package.
.It Cm \&%B
Expands to the list of shared libraries used by programs from the matched package.
.El
.Sh EVALUATION FORMAT
Packages can be selected by using expressions comparing
.Ar Variables
(see below) to string or integer values. The mode of comparison is specified
by the
.Ar Operator
(also listed below).
Expressions can be combined using && (for and) and || (for or).
Parentheses can be used for grouping in the usual manner.
.Pp
String values are either any text not containing whitespace (possibly
followed by but not including whitespace) or any text enclosed in single or
double quotes.
.Ss Variables
.Bl -tag -width F1
.It Cm \&%n
Name of the package (type string)
.It Cm \&%o
Origin of the package (type string)
.It Cm \&%p
Prefix of the package (type string)
.It Cm \&%m
Maintainer of the package (type string)
.It Cm \&%c
Comment of the package (type string)
.It Cm \&%w
WWW address of the package (type string)
.It Cm \&%s
Flatsize of the package (type integer)
.It Cm \&%a
Automatic status of the package (type integer)
.It Cm \&%k
Locking status of the package (type integer)
.It Cm \&%M
Message of the package (type string)
.It Cm \&%t
Timestamp that the package was installed (type integer)
.It Cm \&%i
Additionnal information about the package (type string)
.It Cm \&%# Ns Op drCFODLUGB
Number of elements in the list of information (type integer).
See
.Cm %?
above for what information is used.
.El
.Ss Operators
.Bl -tag -width F1
.It Cm ~
String glob pattern matching
.It Cm > Ns Op =
Integer comparison
.It Cm < Ns Op =
Integer comparison
.It Cm = Ns Op =
Integer or string equality comparison
.It Cm !=
Integer or string inequality comparison
.El
.Sh ENVIRONMENT
The following environment variables affect the execution of
.Nm .
See
.Xr pkg.conf 5
for further description.
.Bl -tag -width ".Ev NO_DESCRIPTIONS"
.It Ev PKG_DBDIR
.El
.Sh FILES
See
.Xr pkg.conf 5 .
.Sh SEE ALSO
.Xr pkg.conf 5 ,
.Xr pkg 8 ,
.Xr pkg-add 8 ,
.Xr pkg-audit 8 ,
.Xr pkg-autoremove 8 ,
.Xr pkg-backup 8 ,
.Xr pkg-check 8 ,
.Xr pkg-clean 8 ,
.Xr pkg-create 8 ,
.Xr pkg-delete 8 ,
.Xr pkg-fetch 8 ,
.Xr pkg-info 8 ,
.Xr pkg-install 8 ,
.Xr pkg-lock 8 ,
.Xr pkg-register 8 ,
.Xr pkg-repo 8 ,
.Xr pkg-rquery 8 ,
.Xr pkg-search 8 ,
.Xr pkg-set 8 ,
.Xr pkg-shell 8 ,
.Xr pkg-shlib 8 ,
.Xr pkg-stats 8 ,
.Xr pkg-update 8 ,
.Xr pkg-updating 8 ,
.Xr pkg-upgrade 8 ,
.Xr pkg-version 8 ,
.Xr pkg-which 8
