freebsd/pkg/pkg/pkg-upgrade.8
.\"
.\" FreeBSD pkg - a next generation package for the installation and maintenance
.\" of non-core utilities.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\"
.\"     @(#)pkg.8
.\" $FreeBSD$
.\"
.Dd May 16, 2012
.Dt PKG-UPGRADE 8
.Os
.Sh NAME
.Nm "pkg upgrade"
.Nd performs upgrades of package software distributions
.Sh SYNOPSIS
.Nm
.Op Fl fLnqy
.Op Fl r reponame
.Sh DESCRIPTION
.Nm
is used for upgrading of package software distributions.
.Pp
Currently only one package repository can be used during package
upgrades.
This is either as defined by the environment variable
.Ev PACKAGESITE ,
or when in multi-repos mode, either the default repository or the
argument to the
.Fl r
option.
.Pp
Soon enough
.Nm
will be able to perform package upgrades from multiple repositories.
.Pp
Repository catalogues will automatically be updated using
.Xr pkg-update 8 .
This can be disabled with the
.Fl L
flag.
.Sh OPTIONS
The following options are supported by
.Nm :
.Bl -tag -width F1
.It Fl f
Force reinstalling/upgrading the whole set of packages
.It Fl L
Don't auto update the remote database with
.Xr pkg-update 8 .
Use the local cache only.
.It Fl n
Dry-run mode: show what packages have updates available, but do not perform
any upgrades.
Repository catalogues will be updated as usual unless the
.Fl L
option is also given.
.It Fl q
Force quiet output, except when
.Fl n
is used, where
.Nm
will always print out the list of packages with available updates.
.It Fl y
Assume yes when asked for confirmation before package installation.
.El
.Sh ENVIRONMENT
The following environment variables affect the execution of
.Nm .
See
.Xr pkg.conf 5
for further description.
.Bl -tag -width ".Ev NO_DESCRIPTIONS"
.It Ev ASSUME_ALWAYS_YES
.It Ev HANDLE_RC_SCRIPTS
.It Ev PACKAGESITE
.It Ev PKG_CACHEDIR
.It Ev PKG_DBDIR
.It Ev PKG_MULTIREPOS
.El
.Sh FILES
See
.Xr pkg.conf 5 .
.Sh SEE ALSO
.Xr pkg 8 ,
.Xr pkg-add 8 ,
.Xr pkg-audit 8 ,
.Xr pkg-autoremove 8 ,
.Xr pkg-backup 8 ,
.Xr pkg-check 8 ,
.Xr pkg-clean 8 ,
.Xr pkg-create 8 ,
.Xr pkg-delete 8 ,
.Xr pkg-fetch 8 ,
.Xr pkg-info 8 ,
.Xr pkg-install 8 ,
.Xr pkg-query 8 ,
.Xr pkg-register 8 ,
.Xr pkg-repo 8 ,
.Xr pkg-rquery 8 ,
.Xr pkg-search 8 ,
.Xr pkg-set 8 ,
.Xr pkg-shell 8 ,
.Xr pkg-shlib 8 ,
.Xr pkg-stats 8 ,
.Xr pkg-update 8 ,
.Xr pkg-updating 8 ,
.Xr pkg-version 8 ,
.Xr pkg-which 8 ,
.Xr pkg.conf 5
