freebsd/pkg/pkg/pkg-register.8
.\"
.\" FreeBSD pkg - a next generation package for the installation and maintenance
.\" of non-core utilities.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\"
.\"     @(#)pkg.8
.\" $FreeBSD$
.\"
.Dd February 16, 2012
.Dt PKG-REGISTER 8
.Os
.Sh NAME
.Nm "pkg register"
.Nd registers a package into the local package database
.Sh SYNOPSIS
.Nm
.Op Fl ld
.Fl f Ar <plist-file>
.Fl m Ar <metadatadir>
.Fl a Ar <arch>
.Fl i Ar <input-path>
.Sh DESCRIPTION
.Nm
is used for registering a package into the local package database.
.Sh OPTIONS
The following options are supported by
.Nm :
.Bl -tag -width F1
.It Fl l
Tells
.Nm
to treat the package to be registered as a legacy one (old style package)
.It Fl d
Mark the package for registering as orphan.
Will be automatically removed if no other packages depend on it.
For more information please refer to
.Xr pkg-autoremove 8
.It Fl f Ar <plist-file>
Specifies the packing list file
.It Fl m Ar <metadatadir>
Specifies the meta data directory to use when registering the package
.It Fl a Ar <arch>
Specifies the package arch.
If this option is not set then the arch will
be automatically detected upon package registration.
.It Fl i Ar <input-path>
Specifies the package input path.
.Pp
< To be completed >
.El
.Sh ENVIRONMENT
The following environment variables affect the execution of
.Nm .
See
.Xr pkg.conf 5
for further description.
.Bl -tag -width ".Ev NO_DESCRIPTIONS"
.It PKG_DBDIR
.El
.Sh FILES
See
.Xr pkg.conf 5 .
.Sh SEE ALSO
.Xr pkg 8 ,
.Xr pkg-add 8 ,
.Xr pkg-audit 8 ,
.Xr pkg-autoremove 8 ,
.Xr pkg-backup 8 ,
.Xr pkg-check 8 ,
.Xr pkg-create 8 ,
.Xr pkg-delete 8 ,
.Xr pkg-info 8 ,
.Xr pkg-install 8 ,
.Xr pkg-repo 8 ,
.Xr pkg-search 8 ,
.Xr pkg-set 8 ,
.Xr pkg-update 8 ,
.Xr pkg-updating 8 ,
.Xr pkg-upgrade 8 ,
.Xr pkg-version 8 ,
.Xr pkg-which 8 ,
.Xr pkg.conf 5
