freebsd/pkg/pkg/pkg.conf.5
.\"
.\" FreeBSD pkg - a next generation package for the installation and maintenance
.\" of non-core utilities.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\"
.\"     @(#)pkg.1
.\" $FreeBSD$
.\"
.Dd Dec 10, 2011
.Dt PKG.CONF 5
.Os
.Sh NAME
.Nm "pkg.conf"
.Nd System-wide configuration file for
.Xr pkg 1
.Sh DESCRIPTION
.Nm
is the system-wide configuration file used by the
.Xr pkg 1
tools.
.Pp
The default location of this file is
.Fa /etc/pkg.conf
.Pp
Lines in the file beginning with a "#" are comments
and are ignored.
.Pp
The file is in YAML format and currently only supports
the
.Fa name : value
notation, but will be extended in the future to support
more options.
.Sh OPTIONS
The following options can be defined in
.Nm :
.Bl -tag -width F1
.It Cm PACKAGESITE
Specifies the remote location to use
when fetching a database file. 
.It Cm PKG_DBDIR
Specifies the directory to use for storing the package
database files. The default value for this option is
.Fa /var/db/pkg
.It Cm PKG_CACHEDIR
Specifies the cache directory for packages. The default value
for this option is
.Fa /var/cache/pkg
.It Cm PORTSDIR
Specifies the location to the Ports directory. The default value
for this option is
.Fa /usr/ports
.It Cm PUBKEY
Specifies the location to the public RSA key used for signing the
repository database. The default value for this file is
.Fa /etc/ssl/pkg.conf
.It Cm HANDLE_RC_SCRIPTS
This option when set to
.Fa YES
will automatically do start/stop of services during package
installation and deinstallation. Default value of this option is
set to
.Fa NO
.El
.Sh WARNING
.Sh ENVRIOMENT
The following envrioment variables affect the execution of
.Xr pkg 1
.Pp
An environment variable with the name of the configuration file
always overrides the value of an option set in
.Fa /etc/pkg.conf
file.
.Sh FILES
.Sh SEE ALSO
.Xr pkg 1 ,
.Xr pkg-add 1 ,
.Xr pkg-autoremove 1 ,
.Xr pkg-search 1 ,
.Xr pkg-backup 1 ,
.Xr pkg-install 1 ,
.Xr pkg-delete 1 ,
.Xr pkg-info 1 ,
.Xr pkg-register 1 ,
.Xr pkg-repo 1 ,
.Xr pkg-update 1 ,
.Xr pkg-upgrade 1 ,
.Xr pkg-version 1 ,
.Xr pkg-which 1 ,
.Sh AUTHORS AND CONTRIBUTORS
.Sh BUGS
