freebsd/pkg/pkg/pkg.conf.5
.\"
.\" FreeBSD pkg - a next generation package for the installation and maintenance
.\" of non-core utilities.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\"
.\"     @(#)pkg.1
.\" $FreeBSD$
.\"
.Dd January 24, 2012
.Dt PKG.CONF 5
.Os
.Sh NAME
.Nm "pkg.conf"
.Nd System-wide configuration file for
.Xr pkg 1
.Sh DESCRIPTION
.Nm
is the system-wide configuration file used by the
.Xr pkg 1
tools.
.Pp
The default location of this file is
.Fa /usr/local/etc/pkg.conf
.Pp
Lines in the file beginning with a "#" are comments
and are ignored.
.Pp
The file is in YAML format. For more information on the syntax of YAML,
please visit the official YAML website - http://www.yaml.org/.
.Pp
The following types of options are recognized -
boolean, string and list options.
.Pp
A boolean option is marked as enabled if one of the following values is
specified in the configuration file -
.Fa YES, TRUE
and
.Fa ON.
.Pp
.Sh OPTIONS
The following options can be defined in
.Nm :
.Bl -tag -width ".Cm ASSUME_ALWAYS_YES(boolean)"
.It Cm ASSUME_ALWAYS_YES(boolean)
When this option is enabled
.Xr pkg 1
will automatically assume "yes" to all questions
which require user confirmation before doing anything, as if it
the
.Fl y
flag was specified. By default this option is disabled.
.It Cm PUBKEY(string)
Specifies the location to the public RSA key used for signing the
repository database. The default value for this file is
.Fa /etc/ssl/pkg.conf
.It Cm HANDLE_RC_SCRIPTS(boolean)
This option when enabled
will automatically perform start/stop of services during package
installation and deinstallation. Services are started on installation only
if they are enabled in
.Fa /etc/rc.conf .
By default this option is disabled.
.It Cm PACKAGESITE(string)
Specifies the remote location to use
when fetching the database file and packages.
.It Cm PKG_CACHEDIR(string)
Specifies the cache directory for packages. The default value
for this option is
.Fa /var/cache/pkg
.It Cm PKG_DBDIR(string)
Specifies the directory to use for storing the package
database files. The default value for this option is
.Fa /var/db/pkg
.It Cm PKG_MULTIREPOS(boolean)
This option when enabled will tell
.Xr pkg 1
to work in mutliple repositories mode. For example repositories
definitions, please have a look at the sample configuration file.
.It Cm PLIST_KEYWORS_DIR(string)
< To be added >
.It Cm PORTSDIR(string)
Specifies the location to the Ports directory. The default value
for this option is
.Fa /usr/ports
.El
.Sh ENVIRONMENT
An environment variable with the same name as the option in the configuration 
file always overrides the value of an option set in the file.
.Sh SEE ALSO
.Xr pkg 1 ,
.Xr pkg-add 1 ,
.Xr pkg-autoremove 1 ,
.Xr pkg-search 1 ,
.Xr pkg-backup 1 ,
.Xr pkg-install 1 ,
.Xr pkg-delete 1 ,
.Xr pkg-info 1 ,
.Xr pkg-register 1 ,
.Xr pkg-repo 1 ,
.Xr pkg-update 1 ,
.Xr pkg-upgrade 1 ,
.Xr pkg-version 1 ,
.Xr pkg-which 1
